spec/dummy/app/controllers/how_tos_controller.rb

  def index
    @how_tos = HowTo.all
---
SELECT "how_tos".* FROM "how_tos"

  def create
    @how_to = HowTo.new(how_to_params)

    if @how_to.save
---
INSERT INTO "how_tos" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "The Moving Toyshop"], ["created_at", "2021-09-10 19:43:50.104352"], ["updated_at", "2021-09-10 19:43:50.104352"]]

  def update
    if @how_to.update(how_to_params)
---
UPDATE "how_tos" SET "instructions" = ?, "updated_at" = ? WHERE "how_tos"."id" = ?

  def destroy
    @how_to.destroy
---
DELETE FROM "how_tos" WHERE "how_tos"."id" = ?  [["id", 6]]

  def set_how_to
    @how_to = HowTo.find(params[:id])
---
SELECT "how_tos".* FROM "how_tos" WHERE "how_tos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]