spec/dummy/app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "description", "serves", "meal", "instructions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "A Darkling Plain"], ["updated_at", "2021-09-10 19:23:06.586291"], ["id", 6]]