spec/dummy/app/controllers/supplies_controller.rb

SELECT "supplies".* FROM "supplies"
---
  def index
    @supplies = Supply.all

SELECT "supplies".* FROM "supplies" WHERE "supplies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_supply
    @supply = Supply.find(params[:id])