spec/dummy/app/controllers/tools_controller.rb

  def set_tool
    @tool = Tool.find(params[:id])
---
SELECT "tools".* FROM "tools" WHERE "tools"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]